       IDENTIFICATION DIVISION.
       PROGRAM-ID. GOVBANKCORE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
           DISPLAY "==================================".
           DISPLAY " GOVBANK CORE - COBOL ENGINE UP ".
           DISPLAY "==================================".
           STOP RUN.
